In [1]:

%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/

In [3]:

%%sql

# create database Normalization;
use Normalization;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

Normalization in SQL is a systematic process of organizing the columns (attributes) and tables (relations) of a relational database to minimize data redundancy 
and improve data integrity. In simpler terms, normalization helps ensure that each piece of data is stored in the best possible place, 
reducing duplication and making it easier to maintain and update the database.

Why Normalize?
Reduce Data Redundancy: Storing the same data multiple times can waste space and cause inconsistencies if that data needs to change.
Improve Data Integrity: Ensures that your data follows certain rules, preventing errors.
Make Maintenance Easier: Updates, deletions, and insertions become simpler and more efficient when data is well-organized.

Common Normal Forms
The most commonly taught normal forms are:

First Normal Form (1NF)
Second Normal Form (2NF)
Third Normal Form (3NF)

(There are higher normal forms like 4NF and 5NF, but they are more specialized and not always required for most practical applications. 
Typically, going up to 3NF or BCNF is sufficient.)

1. First Normal Form (1NF)
Definition & Purpose (1NF)
1NF requires that every column holds only atomic (indivisible) values and that there are no repeating groups.
Purpose: To ensure each field contains a single piece of data.

Before

In [4]:
%%sql

-- Non-1NF Table: contains multi-valued phone_numbers in a single column
CREATE TABLE Students_Non1NF (
    student_id   INT,
    student_name VARCHAR(100),
    phone_numbers VARCHAR(100)  -- e.g., '123-4567,987-6543'
);

-- Sample data insertion (non-atomic phone numbers)
INSERT INTO Students_Non1NF (student_id, student_name, phone_numbers)
VALUES (1, 'Alice', '123-4567,987-6543'),
       (2, 'Bob', '555-1212');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
2 rows affected.

[]

After

In [6]:
%%sql

-- Main Students table with atomic values
CREATE TABLE Students (
    student_id   INT PRIMARY KEY,
    student_name VARCHAR(100)
);

-- Separate table for phone numbers, ensuring each phone number is atomic
CREATE TABLE StudentPhones (
    student_id INT,
    phone      VARCHAR(20),
    PRIMARY KEY (student_id, phone),
    FOREIGN KEY (student_id) REFERENCES Students(student_id)
);

-- Insert students
INSERT INTO Students (student_id, student_name)
VALUES (1, 'Alice'),
       (2, 'Bob');

-- Insert phone numbers (each phone number in its own row)
INSERT INTO StudentPhones (student_id, phone)
VALUES (1, '123-4567'),
       (1, '987-6543'),
       (2, '555-1212');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
2 rows affected.
3 rows affected.

[]

2. Second Normal Form (2NF)
Definition & Purpose (2NF)
2NF requires the table to be in 1NF and that all non-key columns are fully functionally dependent on the entire primary key.
Purpose: To remove partial dependencies (where a column depends on only part of a composite key).

Before

In [7]:
%%sql

-- This table is in 1NF but not in 2NF because course details depend only on course_id.
CREATE TABLE Enrollment_Non2NF (
    student_id  INT,
    course_id   INT,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    PRIMARY KEY (student_id, course_id)
);

-- Sample data insertion
INSERT INTO Enrollment_Non2NF (student_id, course_id, course_name, instructor)
VALUES (1, 101, 'Intro to SQL', 'Dr. Smith'),
       (2, 101, 'Intro to SQL', 'Dr. Smith'),
       (1, 102, 'Database Design', 'Dr. Jones');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.

[]

After

In [9]:
%%sql

-- Table holding course details
CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100)
);

-- Table recording enrollments (relationship)
CREATE TABLE Enrollment (
    student_id INT,
    course_id  INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (course_id) REFERENCES Courses(course_id)
);

-- Insert course details
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

-- Insert enrollment data
INSERT INTO Enrollment (student_id, course_id)
VALUES (1, 101),
       (2, 101),
       (1, 102);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
2 rows affected.
3 rows affected.

[]

3. Third Normal Form (3NF)
Definition & Purpose (3NF)
3NF requires that the table is in 2NF and that all the columns are directly dependent on the primary key 
(i.e., no transitive dependencies).
Purpose: To remove transitive dependencies where a non-key column depends on another non-key column.

Before

In [10]:
%%sql

-- This table is in 2NF but has a transitive dependency:
CREATE TABLE Courses_Non3NF (
    course_id        INT PRIMARY KEY,
    course_name      VARCHAR(100),
    instructor       VARCHAR(100),
    instructor_office VARCHAR(100)
);

-- Sample data insertion
INSERT INTO Courses_Non3NF (course_id, course_name, instructor, instructor_office)
VALUES (101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
       (102, 'Database Design', 'Dr. Jones', 'Room 102');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
2 rows affected.

[]

After

In [14]:
%%sql

-- Drop dependent tables first
DROP TABLE IF EXISTS Enrollment;
DROP TABLE IF EXISTS Courses;
DROP TABLE IF EXISTS Instructors;

-- Recreate tables in dependency order
CREATE TABLE Instructors (
    instructor        VARCHAR(100) PRIMARY KEY,
    instructor_office VARCHAR(100)
);

CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    FOREIGN KEY (instructor) REFERENCES Instructors(instructor)
);

CREATE TABLE Enrollment (
    student_id INT,
    course_id  INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (course_id) REFERENCES Courses(course_id)
);

-- Insert instructor details
INSERT INTO Instructors (instructor, instructor_office)
VALUES ('Dr. Smith', 'Room 101'),
       ('Dr. Jones', 'Room 102');

-- Insert courses
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

-- Insert enrollments (if needed)
INSERT INTO Enrollment (student_id, course_id)
VALUES (1, 101),
       (2, 101),
       (1, 102);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
2 rows affected.
2 rows affected.
3 rows affected.

[]

SCD (Slowly Changing Dimension) is a method used in databases to track and preserve historical changes in data over time.

Why We Use SCD

Track Historical Data: We want to retain older versions of our data for accurate historical analysis and trend reporting (e.g., how many sales happened when the customer had a different address).

Data Accuracy: Ensures that updates to dimension data (like a last name change) wonâ€™t override previous valid data in a way that confuses analysis.

Simplify Reporting and Analytics: Makes it easier for analysts to query the data, knowing they can trust the historical records.

Main Types of SCD

Type 1: Overwrite

Type 2: Add New Record

Type 3: Add New Attribute

Type 1

In [16]:
%%sql

CREATE TABLE dim_product_type1 ( product_id INT PRIMARY KEY,
product_title VARCHAR(255), category VARCHAR(100), brand VARCHAR(100) );

INSERT INTO dim_product_type1 (product_id, product_title, category, brand) VALUES (101, 'Amazon Echo Dot 3rd Gen', 'Smart Speakers', 'Amazon');

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [17]:
%%sql

select * from dim_product_type1

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'Amazon Echo Dot 3rd Gen', 'Smart Speakers', 'Amazon')]

In [18]:
%%sql

UPDATE dim_product_type1 SET product_title = 'Amazon Echo Dot (3rd Gen)' WHERE product_id = 101;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [19]:
%%sql

select * from dim_product_type1

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'Amazon Echo Dot (3rd Gen)', 'Smart Speakers', 'Amazon')]

Type 2

In [20]:
%%sql

CREATE TABLE dim_seller_type2 ( seller_key INT PRIMARY KEY,
seller_id INT,
seller_name VARCHAR(255), store_location VARCHAR(255), effective_date DATE,
end_date DATE,
is_current BOOLEAN
);

INSERT INTO dim_seller_type2 (seller_key, seller_id, seller_name, store_location, effective_date, end_date, is_current) VALUES (1, 501, 'Best Sellers Inc.', 'Seattle, WA', '2022-01-01', NULL, TRUE);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [21]:
%%sql

select * from dim_seller_type2;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), None, 1)]

In [22]:
%%sql
UPDATE dim_seller_type2 SET end_date = '2023-01-15', is_current = FALSE WHERE seller_id = 501 AND is_current = TRUE;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [23]:
%%sql
select * from dim_seller_type2

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), datetime.date(2023, 1, 15), 0)]

In [24]:
%%sql

INSERT INTO dim_seller_type2 (seller_key, seller_id, seller_name, store_location, effective_date, end_date, is_current) VALUES (2, 501, 'Best Sellers Inc.', 'Los Angeles, CA', '2023-01-15', NULL, TRUE);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [25]:
%%sql

select * from dim_seller_type2 where seller_id = 501

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), datetime.date(2023, 1, 15), 0),
 (2, 501, 'Best Sellers Inc.', 'Los Angeles, CA', datetime.date(2023, 1, 15), None, 1)]

Type 3

In [26]:
%%sql

CREATE TABLE dim_product_type3 ( product_id INT PRIMARY KEY,
product_title VARCHAR(255), current_category VARCHAR(100), previous_category VARCHAR(100)
);

INSERT INTO dim_product_type3 (product_id, product_title, current_category, previous_category) VALUES (201, 'Amazon Fire TV Stick', 'Streaming Devices', NULL);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [27]:
%%sql

select * from dim_product_type3;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(201, 'Amazon Fire TV Stick', 'Streaming Devices', None)]

In [28]:
%%sql

UPDATE dim_product_type3 SET previous_category = current_category, current_category = 'Media Players' WHERE product_id = 201;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [29]:
%%sql

select * from dim_product_type3;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(201, 'Amazon Fire TV Stick', 'Media Players', 'Streaming Devices')]